eisup_2019_docmng_integration/src/Documents/абс_КомплектацияОСМ/абс_КомплектацияОСМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>абс_КомплектацияОСМ</name>
  <basedOn>Document.абс_КомплектацияОС</basedOn>
  <registerRecords>InformationRegister.ОсновныеСредстваМеждународныйУчет</registerRecords>
  <registerRecords>AccumulationRegister.абс_СтоимостьОСМеждународный</registerRecords>
  <registerRecords>AccountingRegister.Международный</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.абс_КомплектацияОС</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновноеСредство</name>
    <type>
      <types>CatalogRef.ОсновныеСредства</types>
    </type>
  </attributes>
  <attributes>
    <name>ГлавноеОсновноеСредство</name>
    <type>
      <types>CatalogRef.ОсновныеСредства</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетЗатрат</name>
    <type>
      <types>ChartOfAccountsRef.Международный</types>
    </type>
  </attributes>
  <attributes>
    <name>Субконто1</name>
    <type>
      <types>Characteristic.ВидыСубконтоМеждународные</types>
    </type>
  </attributes>
  <attributes>
    <name>Субконто2</name>
    <type>
      <types>Characteristic.ВидыСубконтоМеждународные</types>
    </type>
  </attributes>
  <attributes>
    <name>Субконто3</name>
    <type>
      <types>Characteristic.ВидыСубконтоМеждународные</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетСниженияСтоимости</name>
    <type>
      <types>ChartOfAccountsRef.Международный</types>
    </type>
  </attributes>
  <attributes>
    <name>Местонахождение</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>МОЛ</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>КоэффициентУскорения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НачислятьАмортизацию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОсновныеСредства</name>
    <attributes>
      <name>ОсновноеСредство</name>
      <type>
        <types>CatalogRef.ОсновныеСредства</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

eisup_2019_docmng_integration/src/InformationRegisters/ОсновныеСредстваМеждународныйУчет/ОсновныеСредстваМеждународныйУчет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОсновныеСредстваМеждународныйУчет</name>
  <comment>(Упр) Сведения об объектах ОС  для целей международного учета</comment>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Организация</name>
    <comment>Организация, на балансе которой учитывется объект ОС в международном учете</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <resources>
    <name>ДатаПринятияКУчету</name>
    <comment>Дата принятия объекта к международному учету</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>МестонахождениеОбъекта</name>
    <comment>Подразделение организации, в котором находится объект ОС</comment>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </resources>
  <resources>
    <name>МОЛ</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </resources>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.ВидыСостоянийОС</types>
    </type>
  </resources>
  <resources>
    <name>СчетУчета</name>
    <comment>Счет учета в плане счетов Международный</comment>
    <type>
      <types>ChartOfAccountsRef.Международный</types>
    </type>
  </resources>
  <resources>
    <name>СрокПолезногоИспользования</name>
    <comment>Срок полезного использования в месяцах</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НачислятьАмортизацию</name>
    <comment>Булево - начиляется амортизация или нет</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>МетодНачисленияАмортизации</name>
    <comment>Метод начисления амортизации по международному учету</comment>
    <type>
      <types>EnumRef.МетодыНачисленияАмортизацииОСМеждународный</types>
    </type>
  </resources>
  <resources>
    <name>СчетНачисленияАмортизации</name>
    <comment>Счет, на котором накапливается начисленная амортизация</comment>
    <type>
      <types>ChartOfAccountsRef.Международный</types>
    </type>
  </resources>
  <resources>
    <name>ПервоначальнаяСтоимость</name>
    <comment>Первоначальная (историческая) стоимость объекта</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>13</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СправедливаяСтоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>13</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЛиквидационнаяСтоимость</name>
    <comment>Стоимость, которая должна остаться после истечения срока полезного использования</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>13</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СчетЗатрат</name>
    <comment>Счет учета, в дебет которого относятся амортизационные отчисления</comment>
    <type>
      <types>ChartOfAccountsRef.Международный</types>
    </type>
  </resources>
  <resources>
    <name>Субконто1</name>
    <comment>Субконто первого уровня счета, в дебет которого относится амортизация</comment>
    <type>
      <types>Characteristic.ВидыСубконтоМеждународные</types>
    </type>
  </resources>
  <resources>
    <name>Субконто2</name>
    <comment>Субконто второго уровня счета, в дебет которого относится амортизация</comment>
    <type>
      <types>Characteristic.ВидыСубконтоМеждународные</types>
    </type>
  </resources>
  <resources>
    <name>Субконто3</name>
    <comment>Субконто третьего уровня счета, в дебет которого относится амортизация</comment>
    <type>
      <types>Characteristic.ВидыСубконтоМеждународные</types>
    </type>
  </resources>
  <resources>
    <name>ПредполагаемыйОбъемПродукции</name>
    <comment>Используется при амортизации пропорционально объему продукции</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаНачисленнойАмортизации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>13</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>УбытокОтОбесценения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоэффициентУскорения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СчетСниженияСтоимости</name>
    <type>
      <types>ChartOfAccountsRef.Международный</types>
    </type>
  </resources>
  <dimensions>
    <name>ОсновноеСредство</name>
    <type>
      <types>CatalogRef.ОсновныеСредства</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/AccumulationRegisters/абс_СтоимостьОСМеждународный/абс_СтоимостьОСМеждународный.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>абс_СтоимостьОСМеждународный</name>
  <resources>
    <name>Стоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Амортизация</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ОсновноеСредство</name>
    <type>
      <types>CatalogRef.ОсновныеСредства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

eisup_2019_docmng_integration/src/InformationRegisters/СоответствиеСчетовБУиМСФО/СоответствиеСчетовБУиМСФО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СоответствиеСчетовБУиМСФО</name>
  <comment>(Упр)</comment>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>СчетМеждународный</name>
    <type>
      <types>ChartOfAccountsRef.Международный</types>
    </type>
  </resources>
  <resources>
    <name>СубконтоМежд1</name>
    <type>
      <types>Characteristic.ВидыСубконтоМеждународные</types>
    </type>
  </resources>
  <resources>
    <name>СубконтоМежд2</name>
    <type>
      <types>Characteristic.ВидыСубконтоМеждународные</types>
    </type>
  </resources>
  <resources>
    <name>СубконтоМежд3</name>
    <type>
      <types>Characteristic.ВидыСубконтоМеждународные</types>
    </type>
  </resources>
  <resources>
    <name>Учитывается</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитПредставление</name>
    <comment>Пользовательское представление реквизита</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Приоритет</name>
    <type>
      <types>EnumRef.ПриоритетПравилПереносаСчетов</types>
    </type>
  </attributes>
  <dimensions>
    <name>СчетХозрасчетный</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидДвижения</name>
    <type>
      <types>EnumRef.ВидыДвиженийБухгалтерии</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СубконтоХозр1</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СубконтоХозр2</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СубконтоХозр3</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Реквизит</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Значение</name>
    <type>
      <types>Boolean</types>
      <types>String</types>
      <types>Date</types>
      <types>Number</types>
      <types>AnyRef</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/AccumulationRegisters/абс_СтоимостьОСРЖД/абс_СтоимостьОСРЖД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>абс_СтоимостьОСРЖД</name>
  <resources>
    <name>Стоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Амортизация</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ОсновноеСредство</name>
    <type>
      <types>CatalogRef.ОсновныеСредства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

eisup_2019_docmng_integration/src/InformationRegisters/абс_СоответствиеОКОФГруппОСРЖД/абс_СоответствиеОКОФГруппОСРЖД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>абс_СоответствиеОКОФГруппОСРЖД</name>
  <resources>
    <name>СрокПолезногоИспользования</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроцентЛиквидационнойСтоимости</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ОКОФ</name>
    <type>
      <types>CatalogRef.ОбщероссийскийКлассификаторОсновныхФондов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ГруппаОСРЖД</name>
    <type>
      <types>CatalogRef.абс_ГруппыОСРЖД</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/Enums/СостоянияОС/СостоянияОС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияОС</name>
  <comment>Состояния ОС</comment>
  <enumValues>
    <name>ПринятоКУчету</name>
    <comment>Принято к учету</comment>
  </enumValues>
  <enumValues>
    <name>ВведеноВЭксплуатацию</name>
    <comment>Введено в эксплуатацию</comment>
  </enumValues>
  <enumValues>
    <name>СнятоСУчета</name>
    <comment>Снято с учета</comment>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Documents/абс_КомплектацияОСМ/ManagerModule.bsl
Функция ПолучитьСтруктуруЗапросовПроведения() Экспорт 

	СтруктураЗапросов = Новый Структура;
	ДобавитьОбщиеЗапросы(СтруктураЗапросов);
	ДобавитьЗапросыДляКомплектации(СтруктураЗапросов);
	
	Возврат СтруктураЗапросов;

КонецФункции

Процедура ДобавитьЗапросыДляКомплектации(СтруктураЗапросов)
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	абс_КомплектацияОСМОсновныеСредства.НомерСтроки,
		|	абс_КомплектацияОСМОсновныеСредства.ОсновноеСредство
		|ПОМЕСТИТЬ ТабличнаяЧастьОсновныеСредства
		|ИЗ
		|	Документ.абс_КомплектацияОСМ.ОсновныеСредства КАК абс_КомплектацияОСМОсновныеСредства
		|ГДЕ
		|	абс_КомплектацияОСМОсновныеСредства.Ссылка = &Ссылка";
	
	СтруктураЗапросов.Вставить("Комплектация_ТекстЗапросаТабличнаяЧастьОсновныеСредства", ТекстЗапроса+";");
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ПериодыРегистраторыСреза.Период,
		|	ПериодыРегистраторыСреза.Регистратор,
		|	ПериодыРегистраторыСреза.ОсновноеСредство КАК ОсновноеСредство,
		|	ОсновныеСредстваМеждународныйУчет.Организация,
		|	ОсновныеСредстваМеждународныйУчет.ДатаПринятияКУчету,
		|	ОсновныеСредстваМеждународныйУчет.МестонахождениеОбъекта,
		|	ОсновныеСредстваМеждународныйУчет.МОЛ,
		|	ОсновныеСредстваМеждународныйУчет.Состояние,
		|	ОсновныеСредстваМеждународныйУчет.СчетУчета,
		|	ОсновныеСредстваМеждународныйУчет.СрокПолезногоИспользования,
		|	ОсновныеСредстваМеждународныйУчет.НачислятьАмортизацию,
		|	ОсновныеСредстваМеждународныйУчет.МетодНачисленияАмортизации,
		|	ОсновныеСредстваМеждународныйУчет.СчетНачисленияАмортизации,
		|	ОсновныеСредстваМеждународныйУчет.ПервоначальнаяСтоимость,
		|	ОсновныеСредстваМеждународныйУчет.СправедливаяСтоимость,
		|	ОсновныеСредстваМеждународныйУчет.ЛиквидационнаяСтоимость,
		|	ОсновныеСредстваМеждународныйУчет.СчетЗатрат,
		|	ОсновныеСредстваМеждународныйУчет.Субконто1,
		|	ОсновныеСредстваМеждународныйУчет.Субконто2,
		|	ОсновныеСредстваМеждународныйУчет.Субконто3,
		|	ОсновныеСредстваМеждународныйУчет.ПредполагаемыйОбъемПродукции,
		|	ОсновныеСредстваМеждународныйУчет.СуммаНачисленнойАмортизации,
		|	ОсновныеСредстваМеждународныйУчет.УбытокОтОбесценения,
		|	ОсновныеСредстваМеждународныйУчет.КоэффициентУскорения,
		|	ОсновныеСредстваМеждународныйУчет.СчетСниженияСтоимости
		|ПОМЕСТИТЬ ПараметрыОсновныхСредств
		|ИЗ
		|	(ВЫБРАТЬ
		|		ПериодыСреза.ОсновноеСредство КАК ОсновноеСредство,
		|		ПериодыСреза.Период КАК Период,
		|		МАКСИМУМ(ОсновныеСредстваМеждународныйУчет.Регистратор) КАК Регистратор
		|	ИЗ
		|		(ВЫБРАТЬ
		|			ТабличнаяЧастьОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
		|			МАКСИМУМ(ОсновныеСредстваМеждународныйУчет.Период) КАК Период
		|		ИЗ
		|			ТабличнаяЧастьОсновныеСредства КАК ТабличнаяЧастьОсновныеСредства
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОсновныеСредстваМеждународныйУчет КАК ОсновныеСредстваМеждународныйУчет
		|				ПО ТабличнаяЧастьОсновныеСредства.ОсновноеСредство = ОсновныеСредстваМеждународныйУчет.ОсновноеСредство
		|					И (ОсновныеСредстваМеждународныйУчет.Период <= &Период)
		|					И (ОсновныеСредстваМеждународныйУчет.Активность)
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ТабличнаяЧастьОсновныеСредства.ОсновноеСредство) КАК ПериодыСреза
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОсновныеСредстваМеждународныйУчет КАК ОсновныеСредстваМеждународныйУчет
		|			ПО ПериодыСреза.ОсновноеСредство = ОсновныеСредстваМеждународныйУчет.ОсновноеСредство
		|				И ПериодыСреза.Период = ОсновныеСредстваМеждународныйУчет.Период
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ПериодыСреза.ОсновноеСредство,
		|		ПериодыСреза.Период) КАК ПериодыРегистраторыСреза
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОсновныеСредстваМеждународныйУчет КАК ОсновныеСредстваМеждународныйУчет
		|		ПО ПериодыРегистраторыСреза.Период = ОсновныеСредстваМеждународныйУчет.Период
		|			И ПериодыРегистраторыСреза.Регистратор = ОсновныеСредстваМеждународныйУчет.Регистратор
		|			И ПериодыРегистраторыСреза.ОсновноеСредство = ОсновныеСредстваМеждународныйУчет.ОсновноеСредство
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ОсновноеСредство";
	
	СтруктураЗапросов.Вставить("абс_ВнеоборотныеАктивы_ТекстЗапросаОсновныеСредстваМСФОПоТаблицеОС", ТекстЗапроса+";");
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	абс_КомплектацияОСМ.Ссылка,
		|	абс_КомплектацияОСМ.Номер,
		|	абс_КомплектацияОСМ.Дата,
		|	абс_КомплектацияОСМ.Организация,
		|	абс_КомплектацияОСМ.ДокументОснование,
		|	абс_КомплектацияОСМ.ОсновноеСредство,
		|	&ГлавноеОсновноеСредство,
		|	ПараметрыОсновныхСредств.СчетУчета,
		|	ПараметрыОсновныхСредств.СчетНачисленияАмортизации,
		|	абс_КомплектацияОСМ.СчетЗатрат,
		|	абс_КомплектацияОСМ.Субконто1,
		|	абс_КомплектацияОСМ.Субконто2,
		|	абс_КомплектацияОСМ.Субконто3,
		|	абс_КомплектацияОСМ.СчетСниженияСтоимости,
		|	абс_КомплектацияОСМ.Местонахождение,
		|	абс_КомплектацияОСМ.МОЛ,
		|	абс_КомплектацияОСМ.КоэффициентУскорения,
		|	ПараметрыОсновныхСредств.СрокПолезногоИспользования,
		|	абс_КомплектацияОСМ.НачислятьАмортизацию,
		|	ПараметрыОсновныхСредств.ОсновноеСредство.ГруппаОС КАК ГруппаОС,
		|	ПараметрыОсновныхСредств.ОсновноеСредство.ЦельИспользования КАК ЦельИспользования
		|ПОМЕСТИТЬ ШапкаДокумента
		|ИЗ
		|	Документ.абс_КомплектацияОСМ КАК абс_КомплектацияОСМ
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПараметрыОсновныхСредств КАК ПараметрыОсновныхСредств
		|		ПО (ПараметрыОсновныхСредств.ОсновноеСредство = &ГлавноеОсновноеСредство)
		|ГДЕ
		|	абс_КомплектацияОСМ.Ссылка = &Ссылка";
	
	СтруктураЗапросов.Вставить("Комплектация_ТекстЗапросаШапкаДокумента", ТекстЗапроса+";");
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	абс_СтоимостьОСМеждународныйОстатки.ОсновноеСредство,
		|	абс_СтоимостьОСМеждународныйОстатки.СтоимостьОстаток КАК Стоимость,
		|	абс_СтоимостьОСМеждународныйОстатки.АмортизацияОстаток КАК Амортизация
		|ПОМЕСТИТЬ СтоимостьОсновныхСредств
		|ИЗ
		|	РегистрНакопления.абс_СтоимостьОСМеждународный.Остатки(
		|			&МоментДокументаДляРН,
		|			ОсновноеСредство В
		|					(ВЫБРАТЬ
		|						ТабличнаяЧастьОсновныеСредства.ОсновноеСредство
		|					ИЗ
		|						ТабличнаяЧастьОсновныеСредства КАК ТабличнаяЧастьОсновныеСредства)
		|				И Организация = &Организация) КАК абс_СтоимостьОСМеждународныйОстатки";
	
	СтруктураЗапросов.Вставить("абс_ВнеоборотныеАктивы_ТекстЗапросаСтоимостьОСМСФОПоТаблицеОС", ТекстЗапроса+";");
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	СУММА(СтоимостьОсновныхСредств.Стоимость) КАК Стоимость,
		|	СУММА(СтоимостьОсновныхСредств.Амортизация) КАК Амортизация
		|ПОМЕСТИТЬ СтоимостьНовогоОсновногоСредства
		|ИЗ
		|	СтоимостьОсновныхСредств КАК СтоимостьОсновныхСредств";
	
	СтруктураЗапросов.Вставить("Комплектация_ТекстЗапросаСтоимостьНовогоОсновногоСредства", ТекстЗапроса+";");
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	СУММА(ПараметрыОсновныхСредств.ПервоначальнаяСтоимость) КАК ПервоначальнаяСтоимость,
		|	СУММА(ПараметрыОсновныхСредств.СправедливаяСтоимость) КАК СправедливаяСтоимость,
		|	СУММА(ПараметрыОсновныхСредств.УбытокОтОбесценения) КАК УбытокОтОбесценения,
		|	СУММА(ПараметрыОсновныхСредств.ЛиквидационнаяСтоимость) КАК ЛиквидационнаяСтоимость
		|ПОМЕСТИТЬ ПервоначальнаяСтоимостьНовогоОсновногоСредства
		|ИЗ
		|	ПараметрыОсновныхСредств КАК ПараметрыОсновныхСредств";
	
	СтруктураЗапросов.Вставить("Комплектация_ТекстЗапросаПервоначальнаяСтоимостьНовогоОсновногоСредства", ТекстЗапроса+";");
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	&Период,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
		|	&Организация,
		|	СтоимостьОсновныхСредств.ОсновноеСредство,
		|	СтоимостьОсновныхСредств.Стоимость,
		|	СтоимостьОсновныхСредств.Амортизация
		|ИЗ
		|	СтоимостьОсновныхСредств КАК СтоимостьОсновныхСредств
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	&Период,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
		|	&Организация,
		|	ШапкаДокумента.ОсновноеСредство,
		|	СтоимостьНовогоОсновногоСредства.Стоимость,
		|	СтоимостьНовогоОсновногоСредства.Амортизация
		|ИЗ
		|	ШапкаДокумента КАК ШапкаДокумента
		|		ЛЕВОЕ СОЕДИНЕНИЕ СтоимостьНовогоОсновногоСредства КАК СтоимостьНовогоОсновногоСредства
		|		ПО (ИСТИНА)";
	
	СтруктураЗапросов.Вставить("Комплектация_ТекстЗапросаТаблица_абс_СтоимостьОСМеждународный", ТекстЗапроса+";");
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	&Период,
		|	ШапкаДокумента.ОсновноеСредство,
		|	&Организация,
		|	ЕСТЬNULL(ПараметрыОсновныхСредств.ДатаПринятияКУчету, ШапкаДокумента.Дата) КАК ДатаПринятияКУчету,
		|	ШапкаДокумента.Местонахождение КАК МестонахождениеОбъекта,
		|	ШапкаДокумента.МОЛ,
		|	ЕСТЬNULL(ПараметрыОсновныхСредств.Состояние, ЗНАЧЕНИЕ(Перечисление.СостоянияОС.ВведеноВЭксплуатацию)) КАК Состояние,
		|	ШапкаДокумента.СчетУчета,
		|	ВЫБОР
		|		КОГДА ШапкаДокумента.СрокПолезногоИспользования = 0
		|			ТОГДА ЕСТЬNULL(СрокиПолезногоИспользования.СрокИспользования, ЕСТЬNULL(ПараметрыОсновныхСредств.СрокПолезногоИспользования, 0))
		|		ИНАЧЕ ШапкаДокумента.СрокПолезногоИспользования
		|	КОНЕЦ КАК СрокПолезногоИспользования,
		|	ШапкаДокумента.НачислятьАмортизацию,
		|	ЕСТЬNULL(ПараметрыОсновныхСредств.МетодНачисленияАмортизации, ЗНАЧЕНИЕ(Перечисление.МетодыНачисленияАмортизацииОСМеждународный.Линейный)) КАК МетодНачисленияАмортизации,
		|	ШапкаДокумента.СчетНачисленияАмортизации,
		|	ЕСТЬNULL(ПервоначальнаяСтоимостьНовогоОсновногоСредства.ПервоначальнаяСтоимость, ЕСТЬNULL(СтоимостьНовогоОсновногоСредства.Стоимость, 0)) КАК ПервоначальнаяСтоимость,
		|	ЕСТЬNULL(ПервоначальнаяСтоимостьНовогоОсновногоСредства.СправедливаяСтоимость, ЕСТЬNULL(СтоимостьНовогоОсновногоСредства.Стоимость, 0)) КАК СправедливаяСтоимость,
		|	ЕСТЬNULL(ПервоначальнаяСтоимостьНовогоОсновногоСредства.ЛиквидационнаяСтоимость, 0) КАК ЛиквидационнаяСтоимость,
		|	ШапкаДокумента.СчетЗатрат,
		|	ШапкаДокумента.Субконто1,
		|	ШапкаДокумента.Субконто2,
		|	ШапкаДокумента.Субконто3,
		|	ПараметрыОсновныхСредств.ПредполагаемыйОбъемПродукции,
		|	СтоимостьНовогоОсновногоСредства.Амортизация КАК СуммаНачисленнойАмортизации,
		|	ЕСТЬNULL(ПервоначальнаяСтоимостьНовогоОсновногоСредства.УбытокОтОбесценения, 0) КАК УбытокОтОбесценения,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ПараметрыОсновныхСредств.КоэффициентУскорения, 0) = 0
		|			ТОГДА 1
		|		ИНАЧЕ ПараметрыОсновныхСредств.КоэффициентУскорения
		|	КОНЕЦ КАК КоэффициентУскорения,
		|	ПараметрыОсновныхСредств.СчетСниженияСтоимости
		|ИЗ
		|	ШапкаДокумента КАК ШапкаДокумента
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПараметрыОсновныхСредств КАК ПараметрыОсновныхСредств
		|		ПО (ПараметрыОсновныхСредств.ОсновноеСредство = &ГлавноеОсновноеСредство)
		|		ЛЕВОЕ СОЕДИНЕНИЕ СрокиПолезногоИспользования КАК СрокиПолезногоИспользования
		|		ПО ШапкаДокумента.ГруппаОС = СрокиПолезногоИспользования.ГруппаОС
		|			И ШапкаДокумента.ЦельИспользования = СрокиПолезногоИспользования.ЦельИспользования
		|		ЛЕВОЕ СОЕДИНЕНИЕ СтоимостьНовогоОсновногоСредства КАК СтоимостьНовогоОсновногоСредства
		|		ПО (ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПервоначальнаяСтоимостьНовогоОсновногоСредства КАК ПервоначальнаяСтоимостьНовогоОсновногоСредства
		|		ПО (ИСТИНА)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	&Период,
		|	ПараметрыОсновныхСредств.ОсновноеСредство,
		|	ПараметрыОсновныхСредств.Организация,
		|	ПараметрыОсновныхСредств.ДатаПринятияКУчету,
		|	ПараметрыОсновныхСредств.МестонахождениеОбъекта,
		|	ПараметрыОсновныхСредств.МОЛ,
		|	ЗНАЧЕНИЕ(Перечисление.СостоянияОС.СнятоСУчета),
		|	ПараметрыОсновныхСредств.СчетУчета,
		|	ПараметрыОсновныхСредств.СрокПолезногоИспользования,
		|	ЛОЖЬ,
		|	ПараметрыОсновныхСредств.МетодНачисленияАмортизации,
		|	ПараметрыОсновныхСредств.СчетНачисленияАмортизации,
		|	ПараметрыОсновныхСредств.ПервоначальнаяСтоимость,
		|	0,
		|	0,
		|	ПараметрыОсновныхСредств.СчетЗатрат,
		|	ПараметрыОсновныхСредств.Субконто1,
		|	ПараметрыОсновныхСредств.Субконто2,
		|	ПараметрыОсновныхСредств.Субконто3,
		|	ПараметрыОсновныхСредств.ПредполагаемыйОбъемПродукции,
		|	0,
		|	0,
		|	ПараметрыОсновныхСредств.КоэффициентУскорения,
		|	ПараметрыОсновныхСредств.СчетСниженияСтоимости
		|ИЗ
		|	ПараметрыОсновныхСредств КАК ПараметрыОсновныхСредств
		|		ЛЕВОЕ СОЕДИНЕНИЕ ШапкаДокумента КАК ШапкаДокумента
		|		ПО ПараметрыОсновныхСредств.ОсновноеСредство = ШапкаДокумента.ОсновноеСредство
		|ГДЕ
		|	ШапкаДокумента.ОсновноеСредство ЕСТЬ NULL ";
	
	СтруктураЗапросов.Вставить("Комплектация_ТекстЗапросаТаблица_ОсновныеСредстваМеждународныйУчет", ТекстЗапроса+";");
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	&Период,
		|	&Организация,
		|	ШапкаДокумента.СчетУчета КАК СчетДт,
		|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоМеждународные.ОсновныеСредства) КАК ВидСубконтоДт1,
		|	ШапкаДокумента.ОсновноеСредство КАК СубконтоДт1,
		|	ПараметрыОсновныхСредств.СчетУчета КАК СчетКт,
		|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоМеждународные.ОсновныеСредства) КАК ВидСубконтоКт1,
		|	СтоимостьОсновныхСредств.ОсновноеСредство КАК СубконтоКт1,
		|	СтоимостьОсновныхСредств.Стоимость КАК Сумма,
		|	""Комплектация ОС"" КАК Содержание,
		|	ШапкаДокумента.ДокументОснование КАК ПервичныйДокумент
		|ИЗ
		|	СтоимостьОсновныхСредств КАК СтоимостьОсновныхСредств
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПараметрыОсновныхСредств КАК ПараметрыОсновныхСредств
		|		ПО СтоимостьОсновныхСредств.ОсновноеСредство = ПараметрыОсновныхСредств.ОсновноеСредство,
		|	ШапкаДокумента КАК ШапкаДокумента
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	&Период,
		|	&Организация,
		|	ПараметрыОсновныхСредств.СчетНачисленияАмортизации,
		|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоМеждународные.ОсновныеСредства),
		|	СтоимостьОсновныхСредств.ОсновноеСредство,
		|	ШапкаДокумента.СчетНачисленияАмортизации,
		|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоМеждународные.ОсновныеСредства),
		|	ШапкаДокумента.ОсновноеСредство,
		|	СтоимостьОсновныхСредств.Амортизация,
		|	""Комплектация ОС"",
		|	ШапкаДокумента.ДокументОснование
		|ИЗ
		|	СтоимостьОсновныхСредств КАК СтоимостьОсновныхСредств
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПараметрыОсновныхСредств КАК ПараметрыОсновныхСредств
		|		ПО СтоимостьОсновныхСредств.ОсновноеСредство = ПараметрыОсновныхСредств.ОсновноеСредство,
		|	ШапкаДокумента КАК ШапкаДокумента";
	
	СтруктураЗапросов.Вставить("Комплектация_ТекстЗапросаТаблица_Международный", ТекстЗапроса+";");
	
	ТекстЗапроса = 
		"УНИЧТОЖИТЬ ТабличнаяЧастьОсновныеСредства
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ПараметрыОсновныхСредств
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ШапкаДокумента
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ СтоимостьОсновныхСредств
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ СтоимостьНовогоОсновногоСредства
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ПервоначальнаяСтоимостьНовогоОсновногоСредства";
	
	СтруктураЗапросов.Вставить("Комплектация_УдалениеВременныхТаблиц", ТекстЗапроса+";");
	
	
КонецПроцедуры

Процедура ДобавитьОбщиеЗапросы(СтруктураЗапросов)

	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	Международный.Ссылка КАК Счет,
		|	ЕСТЬNULL(ВидыСубконто1.ВидСубконто, ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоМеждународные.ПустаяСсылка)) КАК ВидСубконто1,
		|	ЕСТЬNULL(ВидыСубконто2.ВидСубконто, ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоМеждународные.ПустаяСсылка)) КАК ВидСубконто2,
		|	ЕСТЬNULL(ВидыСубконто3.ВидСубконто, ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоМеждународные.ПустаяСсылка)) КАК ВидСубконто3
		|ПОМЕСТИТЬ ВидыСубконтоСчетов
		|ИЗ
		|	ПланСчетов.Международный КАК Международный
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.Международный.ВидыСубконто КАК ВидыСубконто1
		|		ПО Международный.Ссылка = ВидыСубконто1.Ссылка
		|			И (ВидыСубконто1.НомерСтроки = 1)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.Международный.ВидыСубконто КАК ВидыСубконто2
		|		ПО Международный.Ссылка = ВидыСубконто2.Ссылка
		|			И (ВидыСубконто2.НомерСтроки = 2)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.Международный.ВидыСубконто КАК ВидыСубконто3
		|		ПО Международный.Ссылка = ВидыСубконто3.Ссылка
		|			И (ВидыСубконто3.НомерСтроки = 3)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Счет";
		
	СтруктураЗапросов.Вставить("абс_МеждународныйУчет_ТекстЗапросаВидыСубконтоСчетов", ТекстЗапроса+";");
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	СоответствиеСчетовБУиМСФОСрезПоследних.СчетХозрасчетный КАК СчетХозрасчетный,
		|	СоответствиеСчетовБУиМСФОСрезПоследних.ВидДвижения КАК ВидДвижения,
		|	СоответствиеСчетовБУиМСФОСрезПоследних.СчетМеждународный
		|ПОМЕСТИТЬ СоответствиеСчетовХозрасчетныйМСФО
		|ИЗ
		|	РегистрСведений.СоответствиеСчетовБУиМСФО.СрезПоследних(
		|			&Период,
		|			СубконтоХозр1 В (&ПустыеСубконто)
		|				И СубконтоХозр2 В (&ПустыеСубконто)
		|				И СубконтоХозр3 В (&ПустыеСубконто)) КАК СоответствиеСчетовБУиМСФОСрезПоследних
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	СчетХозрасчетный,
		|	ВидДвижения";
		
	СтруктураЗапросов.Вставить("абс_МеждународныйУчет_ТекстЗапросаСоответствиеСчетовХозрасчетный", ТекстЗапроса+";");
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ВЫРАЗИТЬ(ТаблицаСроков.ГруппаОС КАК Перечисление.ГруппыОС) КАК ГруппаОС,
		|	ВЫРАЗИТЬ(ТаблицаСроков.ЦельИспользования КАК Справочник.ЦелиИспользования) КАК ЦельИспользования,
		|	ВЫРАЗИТЬ(ТаблицаСроков.СрокИспользования КАК ЧИСЛО(4, 0)) КАК СрокИспользования
		|ПОМЕСТИТЬ СрокиПолезногоИспользования
		|ИЗ
		|	&ТаблицаСроков КАК ТаблицаСроков
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ГруппаОС,
		|	ЦельИспользования";
		
	СтруктураЗапросов.Вставить("абс_МеждународныйУчет_ТекстЗапросаСрокиПолезногоИспользования", ТекстЗапроса+";");

КонецПроцедуры





















/////////////////////////////////////////////////////////////////////////////////
// Программный интерфейс проведения документов

Процедура ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства, Отказ) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Период", Ссылка.Дата);
	Запрос.УстановитьПараметр("Организация", Ссылка.Организация);
	Запрос.УстановитьПараметр("МоментДокумента", Новый Граница(Ссылка.МоментВремени(), ВидГраницы.Исключая));
	
	ТекстыЗапросов = Новый СписокЗначений;
	ТекстыЗапросов.Добавить(ТекстЗапросаШапкаДокумента(), "");
	ТекстыЗапросов.Добавить(ТекстЗапросаОсновныеСредстваДокумента(), "");
	ТекстыЗапросов.Добавить(абс_ВнеоборотныеАктивы.ТекстЗапроса_ОсновныеСредстваРЖДПоТаблицеОС("ОсновныеСредстваДокумента"), "");
	ТекстыЗапросов.Добавить(ТекстЗапросаОстаткиСтоимостиОС(), "");
	ТекстыЗапросов.Добавить(ТекстЗапросаСтоимостьКомплектации(), "");
	
	ТекстыЗапросов.Добавить(ТекстЗапросаТаблица_абс_ОсновныеСредстваРЖД(), "Таблица_абс_ОсновныеСредстваРЖД");
	ТекстыЗапросов.Добавить(ТекстЗапросаТаблица_абс_СтоимостьОСРЖД(), "Таблица_абс_СтоимостьОСРЖД");
	ТекстыЗапросов.Добавить(ТекстЗапросаТаблица_абс_МеждународныйОСРЖД(), "Таблица_абс_МеждународныйОСРЖД");
	
	абс_ПроведениеДокументов.ИницализироватьТаблицыДляДвижений(Запрос, ТекстыЗапросов, ДополнительныеСвойства.ТаблицыДляДвижений);
	
КонецПроцедуры


/////////////////////////////////////////////////////////////////////////////////
// Функции, возвращающие тексты запросов для инициализации данных документа


Функция ОбщийЗапрос()
	
	Возврат "ВЫБРАТЬ
	        |	абс_КомплектацияОСРЖД.Организация,
	        |	абс_КомплектацияОСРЖД.ДокументОснование,
	        |	абс_КомплектацияОСРЖД.ОсновноеСредство,
	        |	абс_КомплектацияОСРЖД.СчетЗатрат,
	        |	абс_КомплектацияОСРЖД.Субконто1,
	        |	абс_КомплектацияОСРЖД.Субконто2,
	        |	абс_КомплектацияОСРЖД.Субконто3,
	        |	абс_КомплектацияОСРЖД.СчетСниженияСтоимости,
	        |	абс_КомплектацияОСРЖД.Местонахождение,
	        |	абс_КомплектацияОСРЖД.МОЛ,
	        |	абс_КомплектацияОСРЖД.Дата,
	        |	абс_КомплектацияОСРЖД.НачислятьАмортизацию,
	        |	абс_КомплектацияОСРЖД.КоэффициентУскорения
	        |ПОМЕСТИТЬ ШапкаДокумента
	        |ИЗ
	        |	Документ.абс_КомплектацияОСРЖД КАК абс_КомплектацияОСРЖД
	        |ГДЕ
	        |	абс_КомплектацияОСРЖД.Ссылка = &Ссылка
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ШапкаДокумента.ОсновноеСредство КАК ОсновноеСредство
	        |ПОМЕСТИТЬ ОсновныеСредстваДокумента
	        |ИЗ
	        |	ШапкаДокумента КАК ШапкаДокумента
	        |
	        |ОБЪЕДИНИТЬ ВСЕ
	        |
	        |ВЫБРАТЬ
	        |	абс_КомплектацияОСРЖДОсновныеСредства.ОсновноеСредство
	        |ИЗ
	        |	Документ.абс_КомплектацияОСРЖД.ОсновныеСредства КАК абс_КомплектацияОСРЖДОсновныеСредства
	        |ГДЕ
	        |	абс_КомплектацияОСРЖДОсновныеСредства.Ссылка = &Ссылка
	        |
	        |ИНДЕКСИРОВАТЬ ПО
	        |	ОсновноеСредство
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ПериодыРегистраторыСреза.ОсновноеСредство КАК ОсновноеСредство,
	        |	абс_ОсновныеСредстваРЖД.Организация,
	        |	абс_ОсновныеСредстваРЖД.ДатаПринятияКУчету,
	        |	абс_ОсновныеСредстваРЖД.МестонахождениеОбъекта,
	        |	абс_ОсновныеСредстваРЖД.МОЛ,
	        |	абс_ОсновныеСредстваРЖД.Состояние,
	        |	абс_ОсновныеСредстваРЖД.СчетУчета,
	        |	абс_ОсновныеСредстваРЖД.СрокПолезногоИспользования,
	        |	абс_ОсновныеСредстваРЖД.НачислятьАмортизацию,
	        |	абс_ОсновныеСредстваРЖД.МетодНачисленияАмортизации,
	        |	абс_ОсновныеСредстваРЖД.СчетНачисленияАмортизации,
	        |	абс_ОсновныеСредстваРЖД.ПервоначальнаяСтоимость,
	        |	абс_ОсновныеСредстваРЖД.СправедливаяСтоимость,
	        |	абс_ОсновныеСредстваРЖД.ЛиквидационнаяСтоимость,
	        |	абс_ОсновныеСредстваРЖД.СчетЗатрат,
	        |	абс_ОсновныеСредстваРЖД.Субконто1,
	        |	абс_ОсновныеСредстваРЖД.Субконто2,
	        |	абс_ОсновныеСредстваРЖД.Субконто3,
	        |	абс_ОсновныеСредстваРЖД.ПредполагаемыйОбъемПродукции,
	        |	абс_ОсновныеСредстваРЖД.СуммаНачисленнойАмортизации,
	        |	абс_ОсновныеСредстваРЖД.УбытокОтОбесценения,
	        |	абс_ОсновныеСредстваРЖД.КоэффициентУскорения,
	        |	абс_ОсновныеСредстваРЖД.СчетСниженияСтоимости,
	        |	абс_ОсновныеСредстваРЖД.Период,
	        |	абс_ОсновныеСредстваРЖД.Регистратор
	        |ПОМЕСТИТЬ ДанныеРегистра_абс_ОсновныеСредстваРЖД
	        |ИЗ
	        |	(ВЫБРАТЬ
	        |		ПериодыСреза.ОсновноеСредство КАК ОсновноеСредство,
	        |		ПериодыСреза.Период КАК Период,
	        |		МАКСИМУМ(абс_ОсновныеСредстваРЖД.Регистратор) КАК Регистратор
	        |	ИЗ
	        |		(ВЫБРАТЬ
	        |			ОсновныеСредстваДокумента.ОсновноеСредство КАК ОсновноеСредство,
	        |			МАКСИМУМ(абс_ОсновныеСредстваРЖД.Период) КАК Период
	        |		ИЗ
	        |			ОсновныеСредстваДокумента КАК ОсновныеСредстваДокумента
	        |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.абс_ОсновныеСредстваРЖД КАК абс_ОсновныеСредстваРЖД
	        |				ПО ОсновныеСредстваДокумента.ОсновноеСредство = абс_ОсновныеСредстваРЖД.ОсновноеСредство
	        |					И (абс_ОсновныеСредстваРЖД.Период <= &Период)
	        |					И (абс_ОсновныеСредстваРЖД.Активность)
	        |		
	        |		СГРУППИРОВАТЬ ПО
	        |			ОсновныеСредстваДокумента.ОсновноеСредство) КАК ПериодыСреза
	        |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.абс_ОсновныеСредстваРЖД КАК абс_ОсновныеСредстваРЖД
	        |			ПО ПериодыСреза.ОсновноеСредство = абс_ОсновныеСредстваРЖД.ОсновноеСредство
	        |				И ПериодыСреза.Период = абс_ОсновныеСредстваРЖД.Период
	        |				И (абс_ОсновныеСредстваРЖД.Активность)
	        |	
	        |	СГРУППИРОВАТЬ ПО
	        |		ПериодыСреза.ОсновноеСредство,
	        |		ПериодыСреза.Период) КАК ПериодыРегистраторыСреза,
	        |	РегистрСведений.абс_ОсновныеСредстваРЖД КАК абс_ОсновныеСредстваРЖД
	        |
	        |ИНДЕКСИРОВАТЬ ПО
	        |	ОсновноеСредство
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	абс_СтоимостьОСРЖДОстатки.ОсновноеСредство,
	        |	абс_СтоимостьОСРЖДОстатки.СтоимостьОстаток КАК Стоимость,
	        |	абс_СтоимостьОСРЖДОстатки.АмортизацияОстаток КАК Амортизация
	        |ПОМЕСТИТЬ ОстаткиСтоимостиОС
	        |ИЗ
	        |	РегистрНакопления.абс_СтоимостьОСРЖД.Остатки(
	        |			&МоментДокумента,
	        |			ОсновноеСредство В
	        |					(ВЫБРАТЬ
	        |						ОсновныеСредстваДокумента.ОсновноеСредство
	        |					ИЗ
	        |						ОсновныеСредстваДокумента КАК ОсновныеСредстваДокумента)
	        |				И Организация = &Организация) КАК абс_СтоимостьОСРЖДОстатки
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ШапкаДокумента.ОсновноеСредство КАК ОсновноеСредство,
	        |	СУММА(ОстаткиСтоимостиОС.Стоимость) КАК Стоимость,
	        |	СУММА(ОстаткиСтоимостиОС.Амортизация) КАК Амортизация
	        |ПОМЕСТИТЬ СтоимостьКомплектации
	        |ИЗ
	        |	ШапкаДокумента КАК ШапкаДокумента
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ОстаткиСтоимостиОС КАК ОстаткиСтоимостиОС
	        |		ПО ШапкаДокумента.ОсновноеСредство <> ОстаткиСтоимостиОС.ОсновноеСредство
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ШапкаДокумента.ОсновноеСредство
	        |
	        |ИНДЕКСИРОВАТЬ ПО
	        |	ОсновноеСредство
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	&Период,
	        |	&Организация,
	        |	ЗНАЧЕНИЕ(ПланСчетов.абс_МеждународныйОСРЖД.ОсновныеСредстваВОрганизации) КАК СчетДт,
	        |	ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ОсновныеСредства) КАК ВидСубконтоДт1,
	        |	ШапкаДокумента.ОсновноеСредство КАК СубконтоДт1,
	        |	НЕОПРЕДЕЛЕНО КАК ВидСубконтоДт2,
	        |	НЕОПРЕДЕЛЕНО КАК СубконтоДт2,
	        |	НЕОПРЕДЕЛЕНО КАК ВидСубконтоДт3,
	        |	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	        |	ЗНАЧЕНИЕ(ПланСчетов.абс_МеждународныйОСРЖД.ОсновныеСредстваВОрганизации) КАК СчетКт,
	        |	ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ОсновныеСредства) КАК ВидСубконтоКт1,
	        |	ОстаткиСтоимостиОС.ОсновноеСредство КАК СубконтоКт1,
	        |	НЕОПРЕДЕЛЕНО КАК ВидСубконтоКт2,
	        |	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
	        |	НЕОПРЕДЕЛЕНО КАК ВидСубконтоКт3,
	        |	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	        |	ОстаткиСтоимостиОС.Стоимость
	        |ПОМЕСТИТЬ Таблица_абс_МеждународныйОСРЖД
	        |ИЗ
	        |	ОстаткиСтоимостиОС КАК ОстаткиСтоимостиОС,
	        |	ШапкаДокумента КАК ШапкаДокумента
	        |ГДЕ
	        |	ШапкаДокумента.ОсновноеСредство <> ОстаткиСтоимостиОС.ОсновноеСредство
	        |	И ОстаткиСтоимостиОС.Стоимость <> 0
	        |
	        |ОБЪЕДИНИТЬ ВСЕ
	        |
	        |ВЫБРАТЬ
	        |	&Период,
	        |	&Организация,
	        |	ЗНАЧЕНИЕ(ПланСчетов.абс_МеждународныйОСРЖД.АмортизацияОсновныхСредствНа01),
	        |	ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ОсновныеСредства),
	        |	ОстаткиСтоимостиОС.ОсновноеСредство,
	        |	НЕОПРЕДЕЛЕНО,
	        |	НЕОПРЕДЕЛЕНО,
	        |	НЕОПРЕДЕЛЕНО,
	        |	НЕОПРЕДЕЛЕНО,
	        |	ЗНАЧЕНИЕ(ПланСчетов.абс_МеждународныйОСРЖД.АмортизацияОсновныхСредствНа01),
	        |	ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ОсновныеСредства),
	        |	ШапкаДокумента.ОсновноеСредство,
	        |	НЕОПРЕДЕЛЕНО,
	        |	НЕОПРЕДЕЛЕНО,
	        |	НЕОПРЕДЕЛЕНО,
	        |	НЕОПРЕДЕЛЕНО,
	        |	ОстаткиСтоимостиОС.Амортизация
	        |ИЗ
	        |	ОстаткиСтоимостиОС КАК ОстаткиСтоимостиОС,
	        |	ШапкаДокумента КАК ШапкаДокумента
	        |ГДЕ
	        |	ШапкаДокумента.ОсновноеСредство <> ОстаткиСтоимостиОС.ОсновноеСредство
	        |	И ОстаткиСтоимостиОС.Амортизация <> 0
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	&Период,
	        |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	        |	&Организация,
	        |	СтоимостьКомплектации.ОсновноеСредство,
	        |	СтоимостьКомплектации.Стоимость,
	        |	СтоимостьКомплектации.Амортизация
	        |ПОМЕСТИТЬ Таблица_абс_СтоимостьОСРЖД
	        |ИЗ
	        |	СтоимостьКомплектации КАК СтоимостьКомплектации
	        |
	        |ОБЪЕДИНИТЬ ВСЕ
	        |
	        |ВЫБРАТЬ
	        |	&Период,
	        |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
	        |	&Организация,
	        |	СтоимостьКомплектации.ОсновноеСредство,
	        |	СтоимостьКомплектации.Стоимость,
	        |	СтоимостьКомплектации.Амортизация
	        |ИЗ
	        |	СтоимостьКомплектации КАК СтоимостьКомплектации
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ШапкаДокумента КАК ШапкаДокумента
	        |		ПО СтоимостьКомплектации.ОсновноеСредство = ШапкаДокумента.ОсновноеСредство
	        |ГДЕ
	        |	ШапкаДокумента.ОсновноеСредство ЕСТЬ NULL 
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	&Период,
	        |	ВложенныйЗапрос.ОсновноеСредство,
	        |	ВложенныйЗапрос.Организация,
	        |	ЕСТЬNULL(ДанныеРегистра_абс_ОсновныеСредстваРЖД.ДатаПринятияКУчету, ВложенныйЗапрос.Дата) КАК ДатаПринятияКУчету,
	        |	ЕСТЬNULL(ДанныеРегистра_абс_ОсновныеСредстваРЖД.МестонахождениеОбъекта, ВложенныйЗапрос.Местонахождение) КАК МестонахождениеОбъекта,
	        |	ЕСТЬNULL(ДанныеРегистра_абс_ОсновныеСредстваРЖД.МОЛ, ВложенныйЗапрос.МОЛ) КАК МОЛ,
	        |	ЗНАЧЕНИЕ(Перечисление.СостоянияОС.ВведеноВЭксплуатацию) КАК Состояние,
	        |	ЗНАЧЕНИЕ(ПланСчетов.абс_МеждународныйОСРЖД.ОсновныеСредстваВОрганизации) КАК СчетУчета,
	        |	абс_СоответствиеОКОФГруппОСРЖД.СрокПолезногоИспользования,
	        |	ЕСТЬNULL(ДанныеРегистра_абс_ОсновныеСредстваРЖД.НачислятьАмортизацию, ДанныеРегистра_абс_ОсновныеСредстваРЖД.НачислятьАмортизацию) КАК НачислятьАмортизацию,
	        |	ЗНАЧЕНИЕ(Перечисление.МетодыНачисленияАмортизацииОСМеждународный.Линейный) КАК МетодНачисленияАмортизации,
	        |	ЗНАЧЕНИЕ(ПланСчетов.абс_МеждународныйОСРЖД.АмортизацияОсновныхСредствНа01) КАК СчетНачисленияАмортизации,
	        |	ЕСТЬNULL(ДанныеРегистра_абс_ОсновныеСредстваРЖД.ПервоначальнаяСтоимость, СтоимостьКомплектации.Стоимость) КАК ПервоначальнаяСтоимость,
	        |	ЕСТЬNULL(ДанныеРегистра_абс_ОсновныеСредстваРЖД.СправедливаяСтоимость, СтоимостьКомплектации.Стоимость) КАК СправедливаяСтоимость,
	        |	(ЕСТЬNULL(СтоимостьКомплектации.Стоимость, 0) + ЕСТЬNULL(ОстаткиСтоимостиОС.Стоимость, 0)) * ЕСТЬNULL(абс_СоответствиеОКОФГруппОСРЖД.ПроцентЛиквидационнойСтоимости, 0) / 100 КАК ЛиквидационнаяСтоимость,
	        |	ЕСТЬNULL(ДанныеРегистра_абс_ОсновныеСредстваРЖД.СчетЗатрат, ВложенныйЗапрос.СчетЗатрат) КАК СчетЗатрат,
	        |	ЕСТЬNULL(ДанныеРегистра_абс_ОсновныеСредстваРЖД.Субконто1, ВложенныйЗапрос.Субконто1) КАК Субконто1,
	        |	ЕСТЬNULL(ДанныеРегистра_абс_ОсновныеСредстваРЖД.Субконто2, ВложенныйЗапрос.Субконто2) КАК Субконто2,
	        |	ЕСТЬNULL(ДанныеРегистра_абс_ОсновныеСредстваРЖД.Субконто3, ВложенныйЗапрос.Субконто3) КАК Субконто3,
	        |	ДанныеРегистра_абс_ОсновныеСредстваРЖД.ПредполагаемыйОбъемПродукции,
	        |	ЕСТЬNULL(ОстаткиСтоимостиОС.Амортизация, 0) + ЕСТЬNULL(СтоимостьКомплектации.Амортизация, 0) КАК СуммаНачисленнойАмортизации,
	        |	ДанныеРегистра_абс_ОсновныеСредстваРЖД.УбытокОтОбесценения,
	        |	ЕСТЬNULL(ДанныеРегистра_абс_ОсновныеСредстваРЖД.КоэффициентУскорения, ВложенныйЗапрос.КоэффициентУскорения) КАК Поле1,
	        |	ЕСТЬNULL(ДанныеРегистра_абс_ОсновныеСредстваРЖД.СчетСниженияСтоимости, ВложенныйЗапрос.СчетСниженияСтоимости) КАК СчетСниженияСтоимости
	        |ПОМЕСТИТЬ Таблица_абс_ОсновныеСредстваРЖД
	        |ИЗ
	        |	(ВЫБРАТЬ
	        |		ШапкаДокумента.Организация КАК Организация,
	        |		ШапкаДокумента.ОсновноеСредство КАК ОсновноеСредство,
	        |		ШапкаДокумента.СчетЗатрат КАК СчетЗатрат,
	        |		ШапкаДокумента.Субконто1 КАК Субконто1,
	        |		ШапкаДокумента.Субконто2 КАК Субконто2,
	        |		ШапкаДокумента.Субконто3 КАК Субконто3,
	        |		ШапкаДокумента.СчетСниженияСтоимости КАК СчетСниженияСтоимости,
	        |		ШапкаДокумента.Местонахождение КАК Местонахождение,
	        |		ШапкаДокумента.МОЛ КАК МОЛ,
	        |		ШапкаДокумента.Дата КАК Дата,
	        |		ШапкаДокумента.ОсновноеСредство.КодПоОКОФ КАК КодПоОКОФ,
	        |		ШапкаДокумента.ОсновноеСредство.абс_ГруппаОСРЖД КАК ГруппаОСРЖД,
	        |		ШапкаДокумента.НачислятьАмортизацию КАК НачислятьАмортизацию,
	        |		ШапкаДокумента.КоэффициентУскорения КАК КоэффициентУскорения
	        |	ИЗ
	        |		ШапкаДокумента КАК ШапкаДокумента) КАК ВложенныйЗапрос
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеРегистра_абс_ОсновныеСредстваРЖД КАК ДанныеРегистра_абс_ОсновныеСредстваРЖД
	        |		ПО ВложенныйЗапрос.ОсновноеСредство = ДанныеРегистра_абс_ОсновныеСредстваРЖД.ОсновноеСредство
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.абс_СоответствиеОКОФГруппОСРЖД КАК абс_СоответствиеОКОФГруппОСРЖД
	        |		ПО ВложенныйЗапрос.КодПоОКОФ = абс_СоответствиеОКОФГруппОСРЖД.ОКОФ
	        |			И ВложенныйЗапрос.ГруппаОСРЖД = абс_СоответствиеОКОФГруппОСРЖД.ГруппаОСРЖД
	        |		ЛЕВОЕ СОЕДИНЕНИЕ СтоимостьКомплектации КАК СтоимостьКомплектации
	        |		ПО ВложенныйЗапрос.ОсновноеСредство = СтоимостьКомплектации.ОсновноеСредство
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ОстаткиСтоимостиОС КАК ОстаткиСтоимостиОС
	        |		ПО ВложенныйЗапрос.ОсновноеСредство = ОстаткиСтоимостиОС.ОсновноеСредство
	        |
	        |ОБЪЕДИНИТЬ ВСЕ
	        |
	        |ВЫБРАТЬ
	        |	&Период,
	        |	ДанныеРегистра_абс_ОсновныеСредстваРЖД.ОсновноеСредство,
	        |	ДанныеРегистра_абс_ОсновныеСредстваРЖД.Организация,
	        |	ДанныеРегистра_абс_ОсновныеСредстваРЖД.ДатаПринятияКУчету,
	        |	ДанныеРегистра_абс_ОсновныеСредстваРЖД.МестонахождениеОбъекта,
	        |	ДанныеРегистра_абс_ОсновныеСредстваРЖД.МОЛ,
	        |	ЗНАЧЕНИЕ(Перечисление.СостоянияОС.СнятоСУчета),
	        |	ДанныеРегистра_абс_ОсновныеСредстваРЖД.СчетУчета,
	        |	ДанныеРегистра_абс_ОсновныеСредстваРЖД.СрокПолезногоИспользования,
	        |	ДанныеРегистра_абс_ОсновныеСредстваРЖД.НачислятьАмортизацию,
	        |	ДанныеРегистра_абс_ОсновныеСредстваРЖД.МетодНачисленияАмортизации,
	        |	ДанныеРегистра_абс_ОсновныеСредстваРЖД.СчетНачисленияАмортизации,
	        |	ДанныеРегистра_абс_ОсновныеСредстваРЖД.ПервоначальнаяСтоимость,
	        |	ДанныеРегистра_абс_ОсновныеСредстваРЖД.СправедливаяСтоимость,
	        |	ДанныеРегистра_абс_ОсновныеСредстваРЖД.ЛиквидационнаяСтоимость,
	        |	ДанныеРегистра_абс_ОсновныеСредстваРЖД.СчетЗатрат,
	        |	ДанныеРегистра_абс_ОсновныеСредстваРЖД.Субконто1,
	        |	ДанныеРегистра_абс_ОсновныеСредстваРЖД.Субконто2,
	        |	ДанныеРегистра_абс_ОсновныеСредстваРЖД.Субконто3,
	        |	ДанныеРегистра_абс_ОсновныеСредстваРЖД.ПредполагаемыйОбъемПродукции,
	        |	ДанныеРегистра_абс_ОсновныеСредстваРЖД.СуммаНачисленнойАмортизации,
	        |	ДанныеРегистра_абс_ОсновныеСредстваРЖД.УбытокОтОбесценения,
	        |	ДанныеРегистра_абс_ОсновныеСредстваРЖД.КоэффициентУскорения,
	        |	ДанныеРегистра_абс_ОсновныеСредстваРЖД.СчетСниженияСтоимости
	        |ИЗ
	        |	ДанныеРегистра_абс_ОсновныеСредстваРЖД КАК ДанныеРегистра_абс_ОсновныеСредстваРЖД
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ШапкаДокумента КАК ШапкаДокумента
	        |		ПО ДанныеРегистра_абс_ОсновныеСредстваРЖД.ОсновноеСредство = ШапкаДокумента.ОсновноеСредство
	        |ГДЕ
	        |	ШапкаДокумента.ОсновноеСредство ЕСТЬ NULL ";
	
КонецФункции

Функция ТекстЗапросаШапкаДокумента()
	
	Возврат "ВЫБРАТЬ
	        |	абс_КомплектацияОСРЖД.Организация,
	        |	абс_КомплектацияОСРЖД.ДокументОснование,
	        |	абс_КомплектацияОСРЖД.ОсновноеСредство,
	        |	абс_КомплектацияОСРЖД.СчетЗатрат,
	        |	абс_КомплектацияОСРЖД.Субконто1,
	        |	абс_КомплектацияОСРЖД.Субконто2,
	        |	абс_КомплектацияОСРЖД.Субконто3,
	        |	абс_КомплектацияОСРЖД.СчетСниженияСтоимости,
	        |	абс_КомплектацияОСРЖД.Местонахождение,
	        |	абс_КомплектацияОСРЖД.МОЛ,
	        |	абс_КомплектацияОСРЖД.Дата,
	        |	абс_КомплектацияОСРЖД.НачислятьАмортизацию,
	        |	абс_КомплектацияОСРЖД.КоэффициентУскорения
	        |ПОМЕСТИТЬ ШапкаДокумента
	        |ИЗ
	        |	Документ.абс_КомплектацияОСРЖД КАК абс_КомплектацияОСРЖД
	        |ГДЕ
	        |	абс_КомплектацияОСРЖД.Ссылка = &Ссылка
			|;
			|";
	
КонецФункции

Функция ТекстЗапросаОсновныеСредстваДокумента()
	
	Возврат "ВЫБРАТЬ
	        |	ШапкаДокумента.ОсновноеСредство КАК ОсновноеСредство
	        |ПОМЕСТИТЬ ОсновныеСредстваДокумента
	        |ИЗ
	        |	ШапкаДокумента КАК ШапкаДокумента
	        |
	        |ОБЪЕДИНИТЬ ВСЕ
	        |
	        |ВЫБРАТЬ
	        |	абс_КомплектацияОСРЖДОсновныеСредства.ОсновноеСредство
	        |ИЗ
	        |	Документ.абс_КомплектацияОСРЖД.ОсновныеСредства КАК абс_КомплектацияОСРЖДОсновныеСредства
	        |ГДЕ
	        |	абс_КомплектацияОСРЖДОсновныеСредства.Ссылка = &Ссылка
	        |
	        |ИНДЕКСИРОВАТЬ ПО
	        |	ОсновноеСредство
			|;
			|";
	
КонецФункции

Функция ТекстЗапросаОстаткиСтоимостиОС()
	
	Возврат "ВЫБРАТЬ
	        |	абс_СтоимостьОСРЖДОстатки.ОсновноеСредство,
	        |	абс_СтоимостьОСРЖДОстатки.СтоимостьОстаток КАК Стоимость,
	        |	абс_СтоимостьОСРЖДОстатки.АмортизацияОстаток КАК Амортизация
	        |ПОМЕСТИТЬ ОстаткиСтоимостиОС
	        |ИЗ
	        |	РегистрНакопления.абс_СтоимостьОСРЖД.Остатки(
	        |			&МоментДокумента,
	        |			ОсновноеСредство В
	        |					(ВЫБРАТЬ
	        |						ОсновныеСредстваДокумента.ОсновноеСредство
	        |					ИЗ
	        |						ОсновныеСредстваДокумента КАК ОсновныеСредстваДокумента)
	        |				И Организация = &Организация) КАК абс_СтоимостьОСРЖДОстатки
			|;
			|";
	
КонецФункции

Функция ТекстЗапросаСтоимостьКомплектации()
	
	Возврат "ВЫБРАТЬ
	        |	ШапкаДокумента.ОсновноеСредство КАК ОсновноеСредство,
	        |	СУММА(ОстаткиСтоимостиОС.Стоимость) КАК Стоимость,
	        |	СУММА(ОстаткиСтоимостиОС.Амортизация) КАК Амортизация
	        |ПОМЕСТИТЬ СтоимостьКомплектации
	        |ИЗ
	        |	ШапкаДокумента КАК ШапкаДокумента
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ОстаткиСтоимостиОС КАК ОстаткиСтоимостиОС
	        |		ПО ШапкаДокумента.ОсновноеСредство <> ОстаткиСтоимостиОС.ОсновноеСредство
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ШапкаДокумента.ОсновноеСредство
	        |
	        |ИНДЕКСИРОВАТЬ ПО
	        |	ОсновноеСредство
			|;
			|";
	
КонецФункции



Функция ТекстЗапросаТаблица_абс_ОсновныеСредстваРЖД()
	
	Возврат "ВЫБРАТЬ
	        |	&Период,
	        |	ВложенныйЗапрос.ОсновноеСредство,
	        |	ВложенныйЗапрос.Организация,
	        |	ЕСТЬNULL(ДанныеРегистра_абс_ОсновныеСредстваРЖД.ДатаПринятияКУчету, ВложенныйЗапрос.Дата) КАК ДатаПринятияКУчету,
	        |	ЕСТЬNULL(ДанныеРегистра_абс_ОсновныеСредстваРЖД.МестонахождениеОбъекта, ВложенныйЗапрос.Местонахождение) КАК МестонахождениеОбъекта,
	        |	ЕСТЬNULL(ДанныеРегистра_абс_ОсновныеСредстваРЖД.МОЛ, ВложенныйЗапрос.МОЛ) КАК МОЛ,
	        |	ЗНАЧЕНИЕ(Перечисление.СостоянияОС.ВведеноВЭксплуатацию) КАК Состояние,
	        |	ЗНАЧЕНИЕ(ПланСчетов.абс_МеждународныйОСРЖД.ОсновныеСредстваВОрганизации) КАК СчетУчета,
	        |	абс_СоответствиеОКОФГруппОСРЖД.СрокПолезногоИспользования,
	        |	ЕСТЬNULL(ДанныеРегистра_абс_ОсновныеСредстваРЖД.НачислятьАмортизацию, ДанныеРегистра_абс_ОсновныеСредстваРЖД.НачислятьАмортизацию) КАК НачислятьАмортизацию,
	        |	ЗНАЧЕНИЕ(Перечисление.МетодыНачисленияАмортизацииОСМеждународный.Линейный) КАК МетодНачисленияАмортизации,
	        |	ЗНАЧЕНИЕ(ПланСчетов.абс_МеждународныйОСРЖД.АмортизацияОсновныхСредствНа01) КАК СчетНачисленияАмортизации,
	        |	ЕСТЬNULL(ДанныеРегистра_абс_ОсновныеСредстваРЖД.ПервоначальнаяСтоимость, СтоимостьКомплектации.Стоимость) КАК ПервоначальнаяСтоимость,
	        |	ЕСТЬNULL(ДанныеРегистра_абс_ОсновныеСредстваРЖД.СправедливаяСтоимость, СтоимостьКомплектации.Стоимость) КАК СправедливаяСтоимость,
	        |	ВЫРАЗИТЬ((ЕСТЬNULL(СтоимостьКомплектации.Стоимость, 0) + ЕСТЬNULL(ОстаткиСтоимостиОС.Стоимость, 0)) * ЕСТЬNULL(абс_СоответствиеОКОФГруппОСРЖД.ПроцентЛиквидационнойСтоимости, 0) / 100 КАК ЧИСЛО(15,2)) КАК ЛиквидационнаяСтоимость,
	        |	ЕСТЬNULL(ДанныеРегистра_абс_ОсновныеСредстваРЖД.СчетЗатрат, ВложенныйЗапрос.СчетЗатрат) КАК СчетЗатрат,
	        |	ЕСТЬNULL(ДанныеРегистра_абс_ОсновныеСредстваРЖД.Субконто1, ВложенныйЗапрос.Субконто1) КАК Субконто1,
	        |	ЕСТЬNULL(ДанныеРегистра_абс_ОсновныеСредстваРЖД.Субконто2, ВложенныйЗапрос.Субконто2) КАК Субконто2,
	        |	ЕСТЬNULL(ДанныеРегистра_абс_ОсновныеСредстваРЖД.Субконто3, ВложенныйЗапрос.Субконто3) КАК Субконто3,
	        |	ДанныеРегистра_абс_ОсновныеСредстваРЖД.ПредполагаемыйОбъемПродукции,
	        |	ЕСТЬNULL(ОстаткиСтоимостиОС.Амортизация, 0) + ЕСТЬNULL(СтоимостьКомплектации.Амортизация, 0) КАК СуммаНачисленнойАмортизации,
	        |	ДанныеРегистра_абс_ОсновныеСредстваРЖД.УбытокОтОбесценения,
	        |	ЕСТЬNULL(ДанныеРегистра_абс_ОсновныеСредстваРЖД.КоэффициентУскорения, ВложенныйЗапрос.КоэффициентУскорения) КАК Поле1,
	        |	ЕСТЬNULL(ДанныеРегистра_абс_ОсновныеСредстваРЖД.СчетСниженияСтоимости, ВложенныйЗапрос.СчетСниженияСтоимости) КАК СчетСниженияСтоимости
	        |ИЗ
	        |	(ВЫБРАТЬ
	        |		ШапкаДокумента.Организация КАК Организация,
	        |		ШапкаДокумента.ОсновноеСредство КАК ОсновноеСредство,
	        |		ШапкаДокумента.СчетЗатрат КАК СчетЗатрат,
	        |		ШапкаДокумента.Субконто1 КАК Субконто1,
	        |		ШапкаДокумента.Субконто2 КАК Субконто2,
	        |		ШапкаДокумента.Субконто3 КАК Субконто3,
	        |		ШапкаДокумента.СчетСниженияСтоимости КАК СчетСниженияСтоимости,
	        |		ШапкаДокумента.Местонахождение КАК Местонахождение,
	        |		ШапкаДокумента.МОЛ КАК МОЛ,
	        |		ШапкаДокумента.Дата КАК Дата,
	        |		ШапкаДокумента.ОсновноеСредство.КодПоОКОФ КАК КодПоОКОФ,
	        |		ШапкаДокумента.ОсновноеСредство.абс_ГруппаОСРЖД КАК ГруппаОСРЖД,
	        |		ШапкаДокумента.НачислятьАмортизацию КАК НачислятьАмортизацию,
	        |		ШапкаДокумента.КоэффициентУскорения КАК КоэффициентУскорения
	        |	ИЗ
	        |		ШапкаДокумента КАК ШапкаДокумента) КАК ВложенныйЗапрос
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеРегистра_абс_ОсновныеСредстваРЖД КАК ДанныеРегистра_абс_ОсновныеСредстваРЖД
	        |		ПО ВложенныйЗапрос.ОсновноеСредство = ДанныеРегистра_абс_ОсновныеСредстваРЖД.ОсновноеСредство
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.абс_СоответствиеОКОФГруппОСРЖД КАК абс_СоответствиеОКОФГруппОСРЖД
	        |		ПО ВложенныйЗапрос.КодПоОКОФ = абс_СоответствиеОКОФГруппОСРЖД.ОКОФ
	        |			И ВложенныйЗапрос.ГруппаОСРЖД = абс_СоответствиеОКОФГруппОСРЖД.ГруппаОСРЖД
	        |		ЛЕВОЕ СОЕДИНЕНИЕ СтоимостьКомплектации КАК СтоимостьКомплектации
	        |		ПО ВложенныйЗапрос.ОсновноеСредство = СтоимостьКомплектации.ОсновноеСредство
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ОстаткиСтоимостиОС КАК ОстаткиСтоимостиОС
	        |		ПО ВложенныйЗапрос.ОсновноеСредство = ОстаткиСтоимостиОС.ОсновноеСредство
	        |
	        |ОБЪЕДИНИТЬ ВСЕ
	        |
	        |ВЫБРАТЬ
	        |	&Период,
	        |	ДанныеРегистра_абс_ОсновныеСредстваРЖД.ОсновноеСредство,
	        |	ДанныеРегистра_абс_ОсновныеСредстваРЖД.Организация,
	        |	ДанныеРегистра_абс_ОсновныеСредстваРЖД.ДатаПринятияКУчету,
	        |	ДанныеРегистра_абс_ОсновныеСредстваРЖД.МестонахождениеОбъекта,
	        |	ДанныеРегистра_абс_ОсновныеСредстваРЖД.МОЛ,
	        |	ЗНАЧЕНИЕ(Перечисление.СостоянияОС.СнятоСУчета),
	        |	ДанныеРегистра_абс_ОсновныеСредстваРЖД.СчетУчета,
	        |	ДанныеРегистра_абс_ОсновныеСредстваРЖД.СрокПолезногоИспользования,
	        |	ДанныеРегистра_абс_ОсновныеСредстваРЖД.НачислятьАмортизацию,
	        |	ДанныеРегистра_абс_ОсновныеСредстваРЖД.МетодНачисленияАмортизации,
	        |	ДанныеРегистра_абс_ОсновныеСредстваРЖД.СчетНачисленияАмортизации,
	        |	ДанныеРегистра_абс_ОсновныеСредстваРЖД.ПервоначальнаяСтоимость,
	        |	ДанныеРегистра_абс_ОсновныеСредстваРЖД.СправедливаяСтоимость,
	        |	ДанныеРегистра_абс_ОсновныеСредстваРЖД.ЛиквидационнаяСтоимость,
	        |	ДанныеРегистра_абс_ОсновныеСредстваРЖД.СчетЗатрат,
	        |	ДанныеРегистра_абс_ОсновныеСредстваРЖД.Субконто1,
	        |	ДанныеРегистра_абс_ОсновныеСредстваРЖД.Субконто2,
	        |	ДанныеРегистра_абс_ОсновныеСредстваРЖД.Субконто3,
	        |	ДанныеРегистра_абс_ОсновныеСредстваРЖД.ПредполагаемыйОбъемПродукции,
	        |	ДанныеРегистра_абс_ОсновныеСредстваРЖД.СуммаНачисленнойАмортизации,
	        |	ДанныеРегистра_абс_ОсновныеСредстваРЖД.УбытокОтОбесценения,
	        |	ДанныеРегистра_абс_ОсновныеСредстваРЖД.КоэффициентУскорения,
	        |	ДанныеРегистра_абс_ОсновныеСредстваРЖД.СчетСниженияСтоимости
	        |ИЗ
	        |	ДанныеРегистра_абс_ОсновныеСредстваРЖД КАК ДанныеРегистра_абс_ОсновныеСредстваРЖД
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ШапкаДокумента КАК ШапкаДокумента
	        |		ПО ДанныеРегистра_абс_ОсновныеСредстваРЖД.ОсновноеСредство = ШапкаДокумента.ОсновноеСредство
	        |ГДЕ
	        |	ШапкаДокумента.ОсновноеСредство ЕСТЬ NULL
			|;
			|";
	
КонецФункции

Функция ТекстЗапросаТаблица_абс_СтоимостьОСРЖД()
	
	Возврат "ВЫБРАТЬ
	        |	&Период,
	        |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	        |	&Организация,
	        |	СтоимостьКомплектации.ОсновноеСредство,
	        |	СтоимостьКомплектации.Стоимость,
	        |	СтоимостьКомплектации.Амортизация
	        |ИЗ
	        |	СтоимостьКомплектации КАК СтоимостьКомплектации
	        |
	        |ОБЪЕДИНИТЬ ВСЕ
	        |
	        |ВЫБРАТЬ
	        |	&Период,
	        |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
	        |	&Организация,
	        |	СтоимостьКомплектации.ОсновноеСредство,
	        |	СтоимостьКомплектации.Стоимость,
	        |	СтоимостьКомплектации.Амортизация
	        |ИЗ
	        |	СтоимостьКомплектации КАК СтоимостьКомплектации
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ШапкаДокумента КАК ШапкаДокумента
	        |		ПО СтоимостьКомплектации.ОсновноеСредство = ШапкаДокумента.ОсновноеСредство
	        |ГДЕ
	        |	ШапкаДокумента.ОсновноеСредство ЕСТЬ NULL
			|;
			|";
	
КонецФункции

Функция ТекстЗапросаТаблица_абс_МеждународныйОСРЖД()
	
	Возврат "ВЫБРАТЬ
	        |	&Период,
	        |	&Организация,
	        |	ЗНАЧЕНИЕ(ПланСчетов.абс_МеждународныйОСРЖД.ОсновныеСредстваВОрганизации) КАК СчетДт,
	        |	ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ОсновныеСредства) КАК ВидСубконтоДт1,
	        |	ШапкаДокумента.ОсновноеСредство КАК СубконтоДт1,
	        |	НЕОПРЕДЕЛЕНО КАК ВидСубконтоДт2,
	        |	НЕОПРЕДЕЛЕНО КАК СубконтоДт2,
	        |	НЕОПРЕДЕЛЕНО КАК ВидСубконтоДт3,
	        |	НЕОПРЕДЕЛЕНО КАК СубконтоДт3,
	        |	ЗНАЧЕНИЕ(ПланСчетов.абс_МеждународныйОСРЖД.ОсновныеСредстваВОрганизации) КАК СчетКт,
	        |	ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ОсновныеСредства) КАК ВидСубконтоКт1,
	        |	ОстаткиСтоимостиОС.ОсновноеСредство КАК СубконтоКт1,
	        |	НЕОПРЕДЕЛЕНО КАК ВидСубконтоКт2,
	        |	НЕОПРЕДЕЛЕНО КАК СубконтоКт2,
	        |	НЕОПРЕДЕЛЕНО КАК ВидСубконтоКт3,
	        |	НЕОПРЕДЕЛЕНО КАК СубконтоКт3,
	        |	ОстаткиСтоимостиОС.Стоимость
	        |ИЗ
	        |	ОстаткиСтоимостиОС КАК ОстаткиСтоимостиОС,
	        |	ШапкаДокумента КАК ШапкаДокумента
	        |ГДЕ
	        |	ШапкаДокумента.ОсновноеСредство <> ОстаткиСтоимостиОС.ОсновноеСредство
	        |	И ОстаткиСтоимостиОС.Стоимость <> 0
	        |
	        |ОБЪЕДИНИТЬ ВСЕ
	        |
	        |ВЫБРАТЬ
	        |	&Период,
	        |	&Организация,
	        |	ЗНАЧЕНИЕ(ПланСчетов.абс_МеждународныйОСРЖД.АмортизацияОсновныхСредствНа01),
	        |	ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ОсновныеСредства),
	        |	ОстаткиСтоимостиОС.ОсновноеСредство,
	        |	НЕОПРЕДЕЛЕНО,
	        |	НЕОПРЕДЕЛЕНО,
	        |	НЕОПРЕДЕЛЕНО,
	        |	НЕОПРЕДЕЛЕНО,
	        |	ЗНАЧЕНИЕ(ПланСчетов.абс_МеждународныйОСРЖД.АмортизацияОсновныхСредствНа01),
	        |	ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ОсновныеСредства),
	        |	ШапкаДокумента.ОсновноеСредство,
	        |	НЕОПРЕДЕЛЕНО,
	        |	НЕОПРЕДЕЛЕНО,
	        |	НЕОПРЕДЕЛЕНО,
	        |	НЕОПРЕДЕЛЕНО,
	        |	ОстаткиСтоимостиОС.Амортизация
	        |ИЗ
	        |	ОстаткиСтоимостиОС КАК ОстаткиСтоимостиОС,
	        |	ШапкаДокумента КАК ШапкаДокумента
	        |ГДЕ
	        |	ШапкаДокумента.ОсновноеСредство <> ОстаткиСтоимостиОС.ОсновноеСредство
	        |	И ОстаткиСтоимостиОС.Амортизация <> 0
			|;
			|";
	
КонецФункции
